tutorials/verificationAndValidation/turbulentInflow/PCF/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "bottomWall|topWall"
    {
        type            zeroGradient;
    }

    "left|right"
    {
        type            cyclic;
    }

    "inlet|outlet"
    {
        type            calculated;
        value           uniform 1e-08;
    }
}


// ************************************************************************* //
